const RISK_DETECTED = "riskDetected";
const USR_RULES = "useRules";
const SAVE_RULES = "saveRules";
const EXTERNAL_RULES = "externalRules";
const COLLECTION_RULES = "collectionRules";
const EXPRESS_CONSENT = "expressConsent";
const TERM_STATUS = "termStatus";
const USER_PERMISSIONS = "userPermissions";
const SDKS = "sdks";
const APP_GET_INFORMATION = "appGetInformation";
const SDK_GET_INFORMATION = "sdkGetInformation";
const APP_PERMISSIONS = "appPermissions";

const list = [{ "id": "b3764109bcd49711613dd4373e9c94d1", "project": "APP是否在列举业务功能时提醒用户不提供个人信息可能带来的影响", "standard": "在描述各业务功能所收集的个人信息时，需要单独提醒用户不提供个人信息所带来的影响。", "riskLevel": 0, "page": 3.0, "okText": "通过（在列举业务功能时已提醒用户不提供个人信息可能带来的影响） ", "failText": "不通过（在列举业务功能时未提醒用户不提供个人信息可能带来的影响） ", "type": "useRules" },
{ "id": "383ad05164ab2977ca3772cb9341475f", "project": "APP的业务功能与所收集个人信息类型是否一一对应", "standard": "1、APP各项业务功能中，任一业务功能存在实际收集的个人信息不应超出隐私政策所述范围。2、APP实际申请的系统权限、以及调用系统权限的行为应与隐私政策一致。3、隐私政策的描述与实际功能明显不相符，存在照搬、抄袭其他个人信息保护政策的情形。4、APP更新时当收集使用规则发生变化，需要同步调整隐私政策的内容。", "riskLevel": 2, "page": 3.0, "okText": "通过（业务功能与所收集个人信息类型可以对应） ", "failText": "不通过（业务功能与所收集个人信息类型无法对应） ", "type": "useRules" },
{ "id": "3a50ddeb08caceb0a989777e1cee2f39", "project": "APP是否存在明文传输个人信息", "standard": "APP本地的数据以及对外传输的个人信息应该做加密处理。", "riskLevel": 1, "page": 8.0, "okText": "通过（不存在明文传输个人信息） ", "failText": "不通过（存在明文传输个人信息） ", "type": "saveRules" },
{ "id": "d3815da9fabac2b337a87f738f2540cd", "project": "APP是否说明个人信息安全保护措施和能力", "standard": "1、 查看隐私政策条款，是否列举运营单位个人信息保障能力，包括管理能力和技术能力等条款。2、隐私政策中应对APP运营者在个人信息保护方面采取的措施和具备的能力进行说明，如身份鉴别、数据加密、访问控制、恶意代码防范、安全审计等。", "riskLevel": 0, "page": 3.0, "okText": "通过（已说明个人信息安全保护措施和能力） ", "failText": "不通过（未说明个人信息安全保护措施和能力） ", "type": "saveRules" },
{ "id": "420e283f9ed83fc3a27320a7b186b401", "project": "APP是否明示个人信息存储及超期处理方式", "standard": "在隐私政策应对个人信息存放地域（国内、国外）；存储期限（法律规定范围内最短期限或明确期限）、超期处理方式（删除或匿名化处理）进行明确的说明。", "riskLevel": 0, "page": 4.0, "okText": "通过（已明示个人信息存储及超期处理方式） ", "failText": "不通过（未明示个人信息存储及超期处理方式） ", "type": "saveRules" },
{ "id": "e91ca7292b9a9678521cd854fd71793d", "project": "APP是否明示个人信息出境情况", "standard": "1、APP如果有个人信息出境的情况，需要查看隐私政策中是否将出境个人信息类型逐项列出。2、是否将出境个人信息类型显著标识（如字体加粗、标星号、 下划线、斜体、颜色等）。", "riskLevel": 0, "page": 4.0, "okText": "通过（已明示个人信息出境情况）", "failText": "不通过（未明示个人信息出境情况）", "type": "externalRules" },
{ "id": "dba1f67bc8bbd32beffa3aef67cdfcb7", "project": "APP是否说明对外共享、转让、公开披露个人信息规则", "standard": " 如果存在个人信息对外共享、转让、公开披露的情况，隐私政策应说明以下内容： ①对外共享、转让、公开披露个人信息的目的；②涉及的个人信息类型；③接收方类型或身份及承担的法律责任等信息。", "riskLevel": 0, "page": 4.0, "okText": "通过（已说明对外共享、转让、公开披露个人信息规则） ", "failText": "不通过（未说明对外共享、转让、公开披露个人信息规则） ", "type": "externalRules" },
{ "id": "f4a85f10d690426648d6964f6eb3bf84", "project": "APP在启动第三方应用时，是否通过显著方式提示用户阅读第三方应用的个人信息处理规则", "standard": "注1：通过弹出隐私政策的方式向用户告知第三方的身份、联系方式、处理目的、处理方式和个人信息的种类。", "riskLevel": 0, "page": 8.0, "okText": "通过（已通过显著方式提示用户阅读个人信息处理规则） ", "failText": "不通过（未通过显著方式提示用户阅读个人信息处理规则） ", "type": "externalRules" },
{ "id": "d786e211f6b17175aed0f189d24989e6", "project": "APP是否向用户提供关闭或撤回第三方应用收集个人信息授权的功能", "standard": "1、查看APP内是否嵌入第三方应用，若存在，需要向用户未提供关闭或撤回第三方应用的授权管理功能模块。2、查看是否在隐私政策中说明关闭或撤回第三方应用授权管理功能的渠道。", "riskLevel": 0, "page": 8.0, "okText": "通过（已提供关闭或撤回第三方应用收集个人信息授权的功能） ", "failText": "不通过（未提供关闭或撤回第三方应用收集个人信息授权的功能） ", "type": "externalRules" },
{ "id": "972b7874c944eebd13f3d38f0596e8df", "project": "APP是否私自截留第三方应用收集的个人信息", "standard": "1、接入第三方应用时，不得私自截留第三方应用收集的个人信息。2、如信息查询类 App，在用户向第三方应用提交相关个人信息时，截留用户个人信息并上传至其后端服务器的行为属于私自截留个人信息。", "riskLevel": 0, "page": 8.0, "okText": "通过（未私自截留第三方应用收集的个人信息） ", "failText": "不通过（已私自截留第三方应用收集的个人信息） ", "type": "externalRules" },
{ "id": "d786ba28b6636ce064b06e404848a893", "project": "APP在同意隐私政策后，前台状态下收集个人信息的频度是否超出业务功能实际需要", "standard": "收集个人信息的频度不超出业务功能实际需要，在用户使用某业务功能过程中，仅收集与当前业务功能相关的个人信息。", "riskLevel": 2, "page": 5.0, "okText": "通过（前台不存在超频收集个人信息） ", "failText": "不通过（前台存在超频收集个人信息） ", "type": "collectionRules" },
{ "id": "f5a866a51d00d5089ccc38fed53663be", "project": "APP在同意隐私政策后，后台状态下是否有收集个人信息的行为", "standard": "非服务所必需或无合理应用场景，后台状态下不应收集用户的个人信息。", "riskLevel": 2, "page": 5.0, "okText": "通过（不存在收集个人信息行为） ", "failText": "不通过（存在收集个人信息行为） ", "type": "collectionRules" },
{ "id": "93e7ea1ce8383690173a87f545007360", "project": "APP在同意隐私政策后，静默状态下是否有收集个人信息的行为", "standard": "注1：非服务所必需或无合理应用场景，静默状态下不应收集用户的个人信息。", "riskLevel": 2, "page": 5.0, "okText": "通过（不存在收集个人信息行为） ", "failText": "不通过（存在收集个人信息行为） ", "type": "collectionRules" },
{ "id": "808dc3e347b6cd767293a5820e51aa97", "project": "APP在同意隐私政策后，保活后台状态下是否有收集个人信息的行为", "standard": "1、保护后台状态指的是APP已经杀掉进程，处于关闭时的状态。2、非服务所必需或无合理应用场景，保活后台状态下不应收集用户的个人信息。", "riskLevel": 2, "page": 5.0, "okText": "通过（不存在收集个人信息行为） ", "failText": "不通过（存在收集个人信息行为） ", "type": "collectionRules" },
{ "id": "aa7ffd4d2dc6ea0e22ee0d9bb7b91ab3", "project": "APP收集个人信息是否与双清单一致", "standard": "APP在使用过程中收集的信息是否与《个人信息收集清单》和《个人信息与第三方信息共享清单》中明示的个人信息一致。", "riskLevel": 2, "page": 5.0, "okText": "通过（APP收集个人信息与双清单一致） ", "failText": "不通过（APP收集个人信息与双清单不一致） ", "type": "collectionRules" },
{ "id": "8de152772e53e58a44a8f58771313aa5", "project": "APP是否在未同意隐私政策情况下有收集个人信息的行为", "standard": "用户首次使用APP时，在未得知收集个人信息的目的并做出同意前，APP就开始收集个人信息的行为属于未征得用户同意收集个人信息。", "riskLevel": 2, "page": 1.0, "okText": "通过（同意隐私政策前无收集行为） ", "failText": "不通过（同意隐私政策前存在收集行为） ", "type": "collectionRules" },
{ "id": "4bf5ced58621b6aec5c3037b2ffe56b2", "project": "APP是否在未同意隐私政策情况下有申请权限的行为", "standard": "用户首次使用APP时，在未得知收集个人信息的目的并做出同意前，APP就开始向用户申请权限的行为属于未征得用户同意向用户申请权限。", "riskLevel": 2, "page": 1.0, "okText": "通过（同意隐私政策前无权限申请） ", "failText": "不通过（同意隐私政策前存在无权限申请） ", "type": "collectionRules" },
{ "id": "cec8ec971a9e1627985c463b9a47bba4", "project": "APP是否在拒绝隐私政策后有收集个人信息或申请权限的行为", "standard": "当用户拒绝同意隐私政策后的游客模式状态下不得收集个人信息或申请权限。", "riskLevel": 2, "page": 1.0, "okText": "通过（不存在收集个人信息或申请权限的行为） ", "failText": "不通过（存在收集个人信息或申请权限的行为） ", "type": "collectionRules" },
{ "id": "2132806ba7bc82dc29af3f9ce5e78fbe", "project": "APP首次运行时是否通过有效弹窗等明显方式提示用户阅读隐私政策等收集使用规则", "standard": "APP启动主动弹窗提示用户阅读隐私政策，注意隐私政策链接是否能成功访问，如不能访问为无效弹窗，该项不通过。", "riskLevel": 2, "page": 1.0, "okText": "通过（通过弹窗主动提示） ", "failText": "不通过（未通过弹窗主动提示） ", "type": "expressConsent" },
{ "id": "19d4c498b7efb7d12cd713ff2a2dd76d", "project": "APP隐私政策弹窗是否向用户展示隐私政策核心内容", "standard": "1、首次登录的隐私政策弹框中，是否向用户告知个人信息保护政策的核心内容（如基本业务功能、必要个人信息等）。2、首次登录的隐私政策弹框中，是否向用户明示基本业务功能、扩展业务功能和必要个人信息范围，并显著区分必要和非必要个人信息。3、首次登录的隐私政策弹框中，除隐私政策外还需展示服务协议（没有可以不展示）、儿童隐私政策（没有可以不展示）和个人信息与第三方共享清单。", "riskLevel": 0, "page": 1.0, "okText": "通过（App隐私政策弹窗展示核心内容） ", "failText": "不通过（App隐私政策弹窗未展示核心内容）\xa0 ", "type": "expressConsent" },
{ "id": "e6b20b17ffa0244b5632d84f90143575", "project": "APP是否提供同意或不同意隐私政策选项", "standard": "隐私协议同意环节有明确【同意】【不同意】、【同意】【拒绝】等明确按钮方式供用户做出不同意的选项。", "riskLevel": 2, "page": 1.0, "okText": "通过（提供同意/拒绝按钮） ", "failText": "不通过（未提供同意/拒绝按钮） ", "type": "expressConsent" },
{ "id": "9141a84c678b2b522be7c051bfd0a432", "project": "APP是否以默认选择同意隐私政策等非明示方式征求用户同意", "standard": "1、未主动提醒用户阅读隐私政策。2、APP注册登录或其他服务在征求用户同意环节，不得默认勾选隐私政策，需要用户主动勾选。3、APP注册登录服务在征求用户同意环节，不采取登录即代表同意或者无隐私政策链接等非明示方式。", "riskLevel": 2, "page": 2.0, "okText": "通过（不存在默认同意） ", "failText": "不通过（存在默认同意） ", "type": "expressConsent" },
{ "id": "00536d02c0208f7d9ed0e727b6f62c70", "project": "APP在注册或登录以及在登录APP后主界面是否有隐私政策链接", "standard": "在注册/登录界面设置隐私政策链接且可以正常访问。", "riskLevel": 2, "page": 2.0, "okText": "通过（有隐私政策链接） ", "failText": "不通过（无隐私政策链接） ", "type": "expressConsent" },
{ "id": "cf3ce6b0842c7394a1fd15a7869fb018", "project": "APP隐私政策等收集使用规则是否被遮挡", "standard": "是否存在当弹出键盘时遮挡隐私政策，或者是将隐私政策放置于不明显的位置。", "riskLevel": 0, "page": 2.0, "okText": "通过（不存在刻意隐藏隐私政策链接） ", "failText": "不通过（存在刻意隐藏隐私政策链接） ", "type": "expressConsent" },
{ "id": "e15441c1cf5fe73a3473d0bd676ba922", "project": "APP隐私政策等收集使用规则是否易于访问", "standard": "1、进入APP主功能界面后，是否通过 4 次以内的点击，能够访问到隐私政策。2、隐私政策链接真实有效。", "riskLevel": 2, "page": 2.0, "okText": "通过（隐私政策易于访问） ", "failText": "不通过（隐私政策难以访问） ", "type": "expressConsent" },
{ "id": "83cc51a0f5d30fff062ac5d4a02637e3", "project": "APP在收集个人信息敏感时是否通同步告知用户收集的目的", "standard": "1、在同意隐私政策后，遍历功能并查看需要用户提供个人敏感信息的功能，观察APP是否通过显著方式同步告知用户收集个人敏感信息的目的，对目的的描述明确、易懂，建议通过弹窗提示、单独制定协议或在收集界面下方使用文字说明加勾选框的方式同步告知用户采集的目的（如在界面下方采用文字说明加勾选框的方式告知用户收集个人敏感信息的目的）。2、常见的个人敏感信息有：用户身份证号、银行账号、生物识别、宗教信仰、特定身份、医疗健康、金融账户、行踪轨迹以及不满十四周岁未成年人信息等。", "riskLevel": 1, "page": 7.0, "okText": "通过（已单独同意） ", "failText": "不通过（未单独同意） ", "type": "expressConsent" },
{ "id": "135476fea2a450401b48a6adfcef3c8e", "project": "收集不满14周岁未成年人信息是否有主动征求监护人的单独同意", "standard": "1、是否存在收集使用未成年人的个人信息，但未通过个人信息保护政策等告知并征得未成年人或监护人的同意。2、如果存在收集使用未成年人的个人信息，但未设置有效的筛选条件验证是否为未成年人时，需要有单独的“儿童隐私政策”。", "riskLevel": 0, "page": 7.0, "okText": "通过（收集不满14周岁未成年人信息APP主动征求监护人同意） ", "failText": "不通过（收集不满14周岁未成年人信息APP未主动征求监护人同意） ", "type": "expressConsent" },
{ "id": "1001d732879f94cd217360c8a06ce81a", "project": "APP在申请可用权限时是否通过弹窗提示等显著方式同步告知用户申请权限的目的", "standard": "1、在同意隐私政策后，遍历功能并开通所有权限申请，如同意隐私政策后无权限申请，请在APP中操作并触发权限申请，观察APP是否通过显著方式同步告知用户申请当前权限的目的，对目的的描述明确、易懂。2、常见敏感权限类型有：日历、通话记录、相机、通讯录、位置、麦克风、电话、传感器、短信等。", "riskLevel": 1, "page": 6.0, "okText": "通过（已同步告知） ", "failText": "不通过（未同步告知） ", "type": "expressConsent" },
{ "id": "5f8b24104b6d5ae91242fdb699d0f9bf", "project": "APP是否过度索权", "standard": "1、APP首次打开或运行中，未见使用权限对应的相关功能或服务时，提前向用户弹窗申请开启通讯录、定位、短信、录音、相机、日历等权限。2、APP未见提供相关业务功能或者服务，申请通讯录/定位/短信/录音/相机等权限。", "riskLevel": 1, "page": 6.0, "okText": "通过（不存在过度索权） ", "failText": "不通过（存在过度索权） ", "type": "expressConsent" },
{ "id": "f9bc7be940fef834b5893a8b340b3ae2", "project": "APP是否强制索取权限", "standard": "APP运行时，向用户索取电话、通讯录、定位、短信、录音、相机、存储、日历等权限，用户拒绝后，APP退出或关闭、不给权限无法注册登录等情况。", "riskLevel": 2, "page": 6.0, "okText": "通过（不存在强制索权） ", "failText": "不通过（存在强制索权） ", "type": "expressConsent" },
{ "id": "895645d9503a5bcc96992ed065b825e4", "project": "APP是否存在申请与当前业务功能无关权限", "standard": "APP未见提供相关业务功能或服务，不应收集与电话、通讯录、定位、短信、录音、相机、存储、日历等权限。", "riskLevel": 1, "page": 6.0, "okText": "通过（不存在申请与业务无关的权限） ", "failText": "不通过（存在申请与业务无关的权限） ", "type": "expressConsent" },
{ "id": "8f31063ef95b821e7f912f050188957d", "project": "APP是否在用户明确拒绝相关权限后仍频繁弹窗索取权限", "standard": "1、APP启动并运行时向用户申请与当前业务场景无关的权限，在用户拒绝后仍向用户申请已拒绝权限。2、切换到后台（如点击home键回到桌面），再切换回APP界面，APP再次弹窗索取该权限。3、关闭APP，清空后台，再次打开APP后仍然弹窗索取该权限。4、APP运行时，在用户明确拒绝通讯录、定位、短信、录音、相机、日历等权限申请后，不应向用户频繁弹窗申请与当前服务场景无关的权限，影响用户正常使用。5、APP在用户明确拒绝通讯录、定位、短信、录音、相机、日历等权限申请后，重新运行时，APP不应向用户频繁弹窗申请开启与当前业务场景无关的权限，影响用户正常使用。6、超过48小时候再次弹出已拒绝的权限，不属于频繁索权。", "riskLevel": 2, "page": 6.0, "okText": "通过（不存在明确拒绝相关权限后仍频繁弹窗索取权限） ", "failText": "不通过（存在明确拒绝相关权限后仍频繁弹窗索取权限） ", "type": "expressConsent" },
{ "id": "40aa10812836cf321416c98e1ba1988e", "project": "APP是否因用户不同意打开非必要权限，而拒绝用户使用APP基本业务功能", "standard": "APP运行时，不应在用户拒绝打开与业务功能无关的权限后，导致用户无法使用APP的基本业务功能。", "riskLevel": 2, "page": 6.0, "okText": "通过（不存在拒绝非必要权限基本功能无法使用） ", "failText": "不通过（存在拒绝非必要权限基本功能无法使用） ", "type": "expressConsent" },
{ "id": "2859be7bd8a0ccd7e01cced104468bc7", "project": "APP更新后是否更改系统权限设置", "standard": "APP更新升级后，不应更改原有的系统权限设置。", "riskLevel": 0, "page": 6.0, "okText": "通过（不存在更新后更改系统权限设置） ", "failText": "不通过（存在更新后更改系统权限设置） ", "type": "expressConsent" },
{ "id": "1acf3325a06dd2f627d86e2eca33efff", "project": "APP是否存在将多项业务功能和权限打包要求用户一揽子接受的情形", "standard": "1、虽通用户主动填写、点击、勾选等自主选择方式同意，但不得要求用户一次性开启隐私政策中列举的所有业务功能（或多项业务功能）对应的权限。2、APP的安卓手机操作系统应≥Android6.0且 targetSdkVersion ≥23。3、APP 所申请收集个人信息的权限与业务功能一一对应触发。", "riskLevel": 2, "page": 6.0, "okText": "通过（不存在将多项业务功能和权限打包要求用户一揽子接受的情形） ", "failText": "不通过（存在将多项业务功能和权限打包要求用户一揽子接受的情形） ", "type": "expressConsent" },
{ "id": "b5249df8c06e24ba7b07075cdb166199", "project": "APP是否明示用户IP地址归属信息", "standard": "查看在用户昵称后是否标识IP地址归属信息，如：评论、评价等位置。", "riskLevel": 0, "page": 10.0, "okText": "通过（已明示用户IP地址归属信息） ", "failText": "不通过（未明示用户IP地址归属信息） ", "type": "expressConsent" },
{ "id": "cea9b8b770f3a9d39da83723efc3b824", "project": "APP隐私政策等收集使用规则是否单独成文", "standard": "隐私政策以单独成文的形式发布，而不是作为用户协议、用户须知等文件中的一部分存在。", "riskLevel": 1, "page": 3.0, "okText": "通过（隐私政策单独成文） ", "failText": "不通过（隐私政策未单独成文） ", "type": "termStatus" },
{ "id": "e99b7350da1d6cbd0587c3c3387bcc76", "project": "APP是否说明隐私政策时效", "standard": "1、查看隐私政策条款，是否有隐私政策发布、生效或更新日期信息。2、建议发布日期和生效日或更新日期期相差7天。", "riskLevel": 0, "page": 3.0, "okText": "通过（已说明隐私政策时效） ", "failText": "不通过（未说明隐私政策时效） ", "type": "termStatus" },
{ "id": "207d3ae48b7e7bdbcecbc91709205041", "project": "APP是否优化隐私政策展现方式", "standard": "查看是否设立隐私政策摘要或设立隐私政策简明版。", "riskLevel": 2, "page": 3.0, "okText": "通过（已优化隐私政策展现方式） ", "failText": "不通过（未优化隐私政策展现方式） ", "type": "termStatus" },
{ "id": "bdfac897b015ecc738d140bad168b7c9", "project": "APP在列举个人信息及功能时是否使用概括词", "standard": "APP的隐私政策是否在逐项列举收集个人信息的业务功能及其收集的个人信息类型、收集/使用目的、收集具体方式时使用“等、例如”这类概括词", "riskLevel": 1, "page": 3.0, "okText": "通过（未使用概括词） ", "failText": "不通过（多次使用概括词） ", "type": "termStatus" },
{ "id": "83646c4db1db1181cea1796e4ee9ff13", "project": "APP是否是否显著标识个人敏感信息类型", "standard": "在隐私政策中明示收集的个人敏感信息应该显著标识（如字体加粗、标星号、下划线、 斜体、颜色等）。 ", "riskLevel": 0, "page": 3.0, "okText": "通过（已显著标识个人敏感信息） ", "failText": "不通过（未显著标识个人敏感信息） ", "type": "termStatus" },
{ "id": "f2dcf8d010960eef0d3db5a27097675b", "project": "APP隐私政策等收集使用规则是否难以阅读", "standard": "查看文本文字显示方式是否采用与背景颜色相近的字体、刻意缩小字号、文本字号过小、颜色与背景色相近、行间距过密、字迹模糊、列宽大于手机屏幕等易造成阅读困难。", "riskLevel": 2, "page": 3.0, "okText": "通过（隐私政策易于阅读） ", "failText": "不通过（隐私政策难以阅读） ", "type": "termStatus" },
{ "id": "1603849073224f992038e3863cbf81f4", "project": "APP隐私政策等收集使用规则是否难以理解", "standard": "隐私政策应采用通用的语言习惯，通俗易懂，避免使用用晦涩难懂、专业术语或逻辑结构混乱的语句。", "riskLevel": 0, "page": 3.0, "okText": "通过（隐私政策易于理解） ", "failText": "不通过（隐私政策难以理解） ", "type": "termStatus" },
{ "id": "8b6e9a65ff72fba09c75b74c62d8efff", "project": "APP是否仅以改善服务质量、提升用户体验、定向推送信息、研发新产品、增强安全性等为由，强制要求用户同意收集个人信息。", "standard": "隐私政策文本中不得描述与现有业务无关，以为用户改善功能、优化体验、定向推送信息、研发新产品、增强安全性、算法推荐、风险控制等单独作为业务功能为由收集个人信息的描述。", "riskLevel": 2, "page": 3.0, "okText": "通过（不存在强制收集个人信息的行为） ", "failText": "不通过（存在强制收集个人信息的行为） ", "type": "termStatus" },
{ "id": "d65f8c18f2cbc0d408a47a03c885adf3", "project": "APP是否明示运营者的基本情况", "standard": "在隐私政策中应向用户说明包括公司/组织名称、注册/常用办公地址、个人信息保护工作机构或相关负责人（可为运营团队）联系方式等APP 运营者基本情况。 ", "riskLevel": 0, "page": 3.0, "okText": "通过（已明示运营者的基本情况） ", "failText": "不通过（未明示运营者的基本情况） ", "type": "termStatus" },
{ "id": "b0cc18e75733f69b1eda16253cfc2381", "project": "APP是否明示用户权利保障机制", "standard": "查看隐私政策条款，是否包括：个人信息查询、更正、删除、账户注销的操作方法和承诺时限，以及撤回已同意的授权、获取个人信息副本的方法、个人信息转移、对信息系统自动决策结果进行投诉的方法、响应个人信息主体的请求等用户操作方法说明。", "riskLevel": 1, "page": 3.0, "okText": "通过（已明示用户权利保障机制） ", "failText": "不通过（未明示用户权利保障机制） ", "type": "termStatus" },
{ "id": "e0ac4064a1ec118b18b9d698def410cf", "project": "APP是否提供查看隐私政策历史版本渠道", "standard": "查看隐私政策条款，是否提供查看隐私政策历史版本的渠道。", "riskLevel": 0, "page": 3.0, "okText": "通过（已提供查看隐私政策历史版本的渠道） ", "failText": "不通过（提供查看隐私政策历史版本的渠道） ", "type": "termStatus" },
{ "id": "8abec248457fd298bed044dc4162e789", "project": "APP是否说明隐私政策更新时通知用户的方式", "standard": "查看隐私政策条款，是否包括：如果发生业务功能变更、个人信息出境情况变更、使用目的变更、 个人信息保护相关负责人联络方式变更等情形时，隐私政策应进行相应修订，应通过弹窗的方式及时告知用户并再次征得用户同意。", "riskLevel": 2, "page": 3.0, "okText": "通过（已说明隐私政策更新时通知用户的方式） ", "failText": "不通过（未说明隐私政策更新时通知用户的方式） ", "type": "termStatus" },
{ "id": "4528f8cb2cba2351a98abf34c0567b8f", "project": "APP是否收集唯一设备识别码用于定向推送或用户画像场景", "standard": "1、查看在隐私政策条款中是否描述对唯一设备识别码用于定向推送/用户画像等应用场景。2、定向推送信息和用户画像场景采用唯一设备识别码标识用户时，应使用可变更的唯一设备识别码，且不应将其与用户身份信息或不可变更的唯一设备识别码关联。", "riskLevel": 0, "page": 4.0, "okText": "通过（未收集唯一设备识别码用于定向推送或用户画像场景） ", "failText": "不通过（已收集唯一设备识别码用于定向推送或用户画像场景） ", "type": "termStatus" },
{ "id": "2d0df4c7c323d991e6e5ae9f74406804", "project": "APP使用 Cookie 及其同类技术收集个人信息时是否向用户明示", "standard": "注1：使用 Cookie 等同类技术（包括脚本、Clickstream、Web 信标、Flash Cookie、内嵌 web 链接、sdk 等）收集个人信息时，应向用户明示所收集个人信息的目的、类型。", "riskLevel": 0, "page": 4.0, "okText": "通过（使用 Cookie 及其同类技术收集个人信息时已向用户明示） ", "failText": "不通过（使用 Cookie 及其同类技术收集个人信息时未向用户明示） ", "type": "termStatus" },
{ "id": "019f15cbea9bc0c2a62e8a84cbed0e75", "project": "APP是否存在未征得用户同意就读取剪切板或公共存储区", "standard": "查看APP如果有有读取剪切板或公共存储区的功能，是否在隐私政策中向用户明示。", "riskLevel": 2, "page": 4.0, "okText": "通过（不存在未征得用户同意就读取剪切板或公共存储区） ", "failText": "不通过（存在未征得用户同意就读取剪切板或公共存储区） ", "type": "termStatus" },
{ "id": "5777a03155c9c51b394210eb20513a36", "project": "APP是否说明征得授权同意的例外", "standard": "查看隐私隐私政策中是否提供以下告知征得个人信息主体授权同意的例外情形：a）与个人信息控制者履行法律法规规定的义务相关的；b）与国家安全、国防安全直接相关的； c）与公共安全、公共卫生、重大公共利益直接相关的；d）与刑事侦查、起诉、审判和判决执行等直接相关的；e）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；f）所涉及的个人信息是个人信息主体自行向社会公众公开的；g）根据个人信息主体要求签订和履行合同所必需的； 注：个人信息保护政策的主要功能为公开个人信息控制者收集、使用个人信息 范围和规则，不宜将其视为合同。 h）从合法公开披露的信息中收集个人信息的，如合法的新闻报 道、政府信息公开等渠道； i） 维护所提供产品或服务的安全稳定运行所必需的，如发现、处 置产品或服务的故障； j）个人信息控制者为新闻单位，且其开展合法的新闻报道所必需 的；k）个人信息控制者为学术研究机构，出于公共利益开展统计或学 术研究所必要，且其对外提供学术研究或描述的结果时，对结果 中所包含的个人信息进行去标识化处理的。", "riskLevel": 0, "page": 4.0, "okText": "通过（已说明征得授权同意的例外） ", "failText": "不通过（未说明征得授权同意的例外） ", "type": "termStatus" },
{ "id": "1dc78bf74659c19a49e3e599c3022551", "project": "APP是否明示功能划分", "standard": "1、查看隐私政策中，是否按照 14 号文的要求对应服务类型划分APP 的基本业务功能。2、查看隐私政策中，是否明确实现用户主要使用目的的业务功能所属的服务类型为该 APP 的类型。3、查看隐私政策中，如 APP 所属类型不在 14 号文的规定范围内，是否将实现用户主要使用目的的业务功能划分为基本业务功能，其他之外的业务功能划分为扩展业务功能。4、查看隐私政策中，是否将仅实现改善服务质量、提升使用体验、定向推送信息、研发新产品等目的的业务功能，划分为扩展业务功能。5、查看隐私政策中，是否将外部第三方或关联公司提供的业务功能划分为扩展业务功能。6、查看隐私政策中，如基本业务功能有多种可选实现方式，是否将用户个人权益影响更大的实现方式划分为扩展业务功能。 ", "riskLevel": 0, "page": 4.0, "okText": "通过（已明示功能划分） ", "failText": "不通过（未明示功能划分） ", "type": "termStatus" },
{ "id": "7d5b30030b5a05d124c818acfe15d0ee", "project": "APP的广告弹窗规则是否在隐私政策中明示", "standard": "APP应该以服务协议等明确告知用户弹窗信息推送服务的具体形式、内容频次、取消渠道等，充分考虑用户体验，科学规划推送频次，不得对普通用户和会员用户进行不合理地差别推送。", "riskLevel": 0, "page": 4.0, "okText": "通过（已在隐私政策中明示） ", "failText": "不通过（未在隐私政策中明示） ", "type": "termStatus" },
{ "id": "0b741086ecc53ca827d7f1ab0fa844b5", "project": "APP是否提供浏览模式", "standard": "APP为用户提供无需注册即可使用的服务模式（如仅浏览、游客模式），当用户拒绝同意该类服务模式以外的个人信息收集行为时，不影响其使用仅浏览等功能（注：需为用户提供进入浏览模式的选项）。", "riskLevel": 0, "page": 9.0, "okText": "通过（已提供浏览模式） ", "failText": "不通过（未提供浏览模式） ", "type": "userPermissions" },
{ "id": "1e0fca3080ec57a14eae18711368a9d0", "project": "APP是否存在自启动行为", "standard": "APP 未向用户告知且未经用户同意，或无合理的使用场景，频繁自启动或关联启动第三方 APP 的行为。", "riskLevel": 2, "page": 9.0, "okText": "通过（不存在自启动行为） ", "failText": "不通过（存在自启动行为） ", "type": "userPermissions" },
{ "id": "8954768299c59e57b0b76ad957ceadeb", "project": "APP是否提供人工客服服务", "standard": "从事互联网信息服务的企业应建立客服热线电话，并在网站、APP等显著位置公示客服热线电话号码。并向老年人提供人工直连热线服务，客服热线力争达到月均响应时限最长为30秒，人工服务的应答率超过85％。", "riskLevel": 0, "page": 9.0, "okText": "通过（已提供人工客服） ", "failText": "不通过（未提供人工客服） ", "type": "userPermissions" },
{ "id": "1f43a74d0e6e212e5b58d50087108484", "project": "APP是否妥善处理用户投诉", "standard": "APP应公布有效联系方式，接受用户投诉。按照规范要求答复互联网信息服务投诉平台上的投诉，确保15日内处理完成，提高投诉处理满意率。建议可以在APP中设置用户满意度测评链接，引导用户参与测评。", "riskLevel": 2, "page": 9.0, "okText": "通过（已妥善处理用户投诉） ", "failText": "不通过（未妥善处理用户投诉） ", "type": "userPermissions" },
{ "id": "6f1b4e91b73ac88e93e202ba93ee3e1a", "project": "APP利用用户个人信息和算法定向推送信息，是否提供非定向推送或个性化推荐的关闭选项", "standard": "1、存在利用用户个人信息和算法定向推送信息情形时（包括利用个人信息和个性化推荐算法等推送新闻和信息、展示商品、推送广告等）， 需为用户提供拒绝接收定向推送信息，或停止、退出、关闭相应功能的机制，或不基于个人信息和个性化推荐算法等推送的模式、选项。2、判断APP是否涉及定向推送或个性化，可通过隐私政策文本描述或APP实际业务判断是否涉及，如果涉及定向推送或者是个性化但是在隐私政策中没有相关条款的说明（如关闭个性化推荐或定向推送的路径），该项同样不通过。", "riskLevel": 2, "page": 9.0, "okText": "通过（提供关闭定向推送选项） ", "failText": "不通过（不提供关闭定向推送选项） ", "type": "userPermissions" },
{ "id": "1eb70ed3d3689c424f0a814f39ad825f", "project": "APP是否显著区分定向推送服务", "standard": "若APP存在定向推送或个性化推荐的功能，则页面中应该显著区分定向推送服务，显著方式包括但不限于：标明“个 性化推荐”、“定推”、“猜你喜欢”等其他能显著区分的字样， 在推荐商品或内容的列表页或详情页，有“根据你的搜索推荐”“根据你的兴趣推荐”等字样进行标识。", "riskLevel": 0, "page": 9.0, "okText": "通过（已显著区分定向推送服务） ", "failText": "不通过（未显著区分定向推送服务） ", "type": "userPermissions" },
{ "id": "08b5d7a6e2f00120293cb8cf16e0e695", "project": "APP是否在隐私政策中向用户明示建立个人信息保护“双清单”制度", "standard": "1、将收集个人信息以及与第三方共享个人信息，在隐私政策设立单独的链接呈现。2、第三方共享个人信息清单是否简洁、清晰列出APP与第三方共享的用户个人信息基本情况，包括第三方名称、所属公司、收集个人信息的类型和范围、共享方式、用途及申请权限的目的、使用场景和官网地址等。", "riskLevel": 2, "page": 9.0, "okText": "通过（已在隐私政策中明示） ", "failText": "不通过（未在隐私政策中明示） ", "type": "userPermissions" },
{ "id": "7e68f0e5dc632e4497aaad3c01dad863", "project": "APP是否在二级菜单中向用户明示建立个人信息保护“双清单”制度", "standard": "1、将收集个人信息以及与第三方共享个人信息，在APP的二级菜单中设立单独的模块展示。2、第三方共享个人信息清单是否简洁、清晰列出APP与第三方共享的用户个人信息基本情况，包括第三方名称、所属公司、收集个人信息的类型和范围、共享方式、用途及申请权限的目的、使用场景、官网地址和隐私政策链接。", "riskLevel": 2, "page": 9.0, "okText": "通过（已在二级菜单中展示） ", "failText": "不通过（未在二级菜单中展示） ", "type": "userPermissions" },
{ "id": "274dc1e61bc89445394b4a6bbfe25099", "project": "APP是否优化权限调用的展示方式", "standard": "通过查看APP的功能内是否设立单独的权限管理功能模块（用户可以通过权限管理功能模块关闭授予的权限），且是否同步展示其收集的目的。", "riskLevel": 2, "page": 9.0, "okText": "通过（已优化权限调用的展示方式） ", "failText": "不通过（未优化权限调用的展示方式） ", "type": "userPermissions" },
{ "id": "0cb03521c9adcbfe16ff0a9c81c13502", "project": "APP是否提供投诉、举报功能", "standard": "查看隐私政策中是否说明相关的投诉、举报渠道，且承诺处理时限不超过15个工作日。注2：查看隐私政策中是否说明外部纠纷解决机构及联络方式。注3：渠道：1．电子邮件； 2．电话； 3．传真； 4．在线客服； 5．在线表格； 6．即时通信账号等", "riskLevel": 1, "page": 9.0, "okText": "通过（提供投诉举报功能） ", "failText": "不通过（未提供投诉举报功能） ", "type": "userPermissions" },
{ "id": "f91b37e5b6141e68362a08c60b6a542c", "project": "APP是否提供注销功能", "standard": "1、查看APP是否提供注销功能。2、注销入口建议设置在相关菜单下或在用户进入应用主界面点击不超过 5 次的位置。3、当用户注销账号后，应及删除个人信息或进行匿名化处理。", "riskLevel": 2, "page": 9.0, "okText": "通过（已提供注销功能） ", "failText": "不通过（未提供注销功能） ", "type": "userPermissions" },
{ "id": "fc2408dc47255636bee2533f56b9cec2", "project": "APP在用户注销时是否设置不必要或不合理条件", "standard": "1、注销过程如需进行身份核验，不应要求用户再次提供的个人信息多于注册、使用等服务环节收集的个人信息。2、注销过程设置不合理的条件，如：账户注册时间未满 24 小时不得注销、注销后15天内不得再次注册等。3、APP响应用户的注销请求不得超过15个工作日。", "riskLevel": 2, "page": 9.0, "okText": "通过（在用户注销时未设置不必要或不合理条件） ", "failText": "不通过（在用户注销时设置不必要或不合理条件） ", "type": "userPermissions" },
{ "id": "1520f4782b9a974d0ebc6c8a65302812", "project": "APP是否提供撤回同意的授权功能", "standard": "1、查看APP是否提供撤回已同意的授权（撤回隐私政策和撤回已经授权的权限的路径）2、查看隐私政策中撤回功能的路径与实际是否一致。", "riskLevel": 1, "page": 9.0, "okText": "通过（APP已提供撤回同意的授权功能） ", "failText": "不通过（APP未提供撤回同意的授权功能） ", "type": "userPermissions" },
{ "id": "37bc5ab8a2e190beaeb55516d7ad1217", "project": "APP是否提供更正、删除、查询个人信息功能", "standard": "1、查看APP是否提供查询、更正、删除个人信息的途径，该途径可以是在线功能界面、客服电话、服务邮箱等。2、查看隐私政策中撤回功能的路径与实际是否一致。3、查看满足个人信息删除的情形，用户申请删除个人信息后，APP经营者是否进行匿名化处理（是否在隐私政策说明）。", "riskLevel": 2, "page": 9.0, "okText": "通过（已提供更正、删除、查询个人信息功能） ", "failText": "不通过（未提供更正、删除、查询个人信息功能） ", "type": "userPermissions" },
{ "id": "33f1e0616d85a5255a1c550d71e6ea2c", "project": "APP是否对个人信息的展示进行限制", "standard": "APP涉及通过界面展示个人信息的（如显示屏幕、纸面），个人信息 控制者应该对需展示的个人信息采取去标识化处理等措施，降低个人信息在展示环节的泄露风险，如手机号、姓名、银行卡号、身份证等个人信息。", "riskLevel": 0, "page": 7.0, "okText": "通过（对个人信息的展示进行限制） ", "failText": "不通过（未对个人信息的展示进行限制） ", "type": "userPermissions" },
{ "id": "924160a9b2c00b45fcafa41f7d820f4b", "project": "APP是否以欺诈、诱骗等不正当方式误导用户同意收集个人信息或打开可收集个人信息的权限", "standard": "1、故意欺骗、掩饰收集个人信息的真实目的，如APP通过积分、奖励、优惠等方式欺骗误导用户提供身份证号码以及个人生物特征信息的行为。2、APP广告页面、开屏广告、主屏等功能界面，不应通过红包、积分、奖励、优惠等方式欺骗误导用户提供身份证号码以及个人生物特征信息的行为。", "riskLevel": 0, "page": 7.0, "okText": "通过（不存在误导用户提供个人信息的行为） ", "failText": "不通过（存在误导用户提供个人信息的行为） ", "type": "userPermissions" },
{ "id": "be4cddfe5f98bf90f0b7e260a10c21dd", "project": "是否制定专门的未成年人个人信息处理规则", "standard": "如果存在收集使用未成年人的个人信息，但未设置有效的筛选条件验证是否为未成年人时，需要有单独的“儿童隐私政策”。注2：儿童隐私政策中应包含以下内容：1、APP 运营者的名称或姓名和联系方式；2、未成年人个人信息的处理目的、处理方式；3、处理的未成年人个人信息种类、保存期限；4、用户行使个人信息权利的方式和程序；5、处理未成年人个人信息的必要性；6、对未成年人个人权益的影响。", "riskLevel": 0, "page": 7.0, "okText": "通过（已制定专门的未成年人个人信息处理规则） ", "failText": "不通过（未制定专门的未成年人个人信息处理规则） ", "type": "userPermissions" },
{ "id": "7a9cbad668aa8436ba27ec7829eb2202", "project": "APP内广告是否有关闭选项", "standard": "1、查看APP中的广告页面、开屏广告、主屏等功能页面，是否有明显的关闭按钮。2、“跳过/关闭”应真实、有效，确保用户可以一键关闭广告。3、不得延迟展示关闭按钮。", "riskLevel": 2, "page": 10.0, "okText": "通过（有明显广告关闭按钮） ", "failText": "不通过（没有明显广告关闭按钮） ", "type": "userPermissions" },
{ "id": "07f5716fe5ca1526f774fadf4290594c", "project": "APP是否欺骗误导强迫用户点击跳转", "standard": "APP 信息窗口（如开屏广告页面）通过用户“摇一摇”、“点击跳转”等交互动作触发页面或第三方应用跳转的，未清晰明示用户需要执行的触发动作及交互预期，或通过设置高灵敏度降低交互动作判定阈值，造成误导、强迫式跳转。注：“摇一摇”触发用户跳转的交互动作可参照如设备加速度不小于 15m/s2，转动角度不小于 35°，操作时间不少于 3s，或同时考虑加速度值与方向、转动角度的方式，或与前述单一触发条件等效的其他参数设置，确保用户在走路、乘车、拾起放下移动智能终端等日常生活中，非用户主动触发跳转的情况下，不会出现误导、强迫跳转。", "riskLevel": 2, "page": 10.0, "okText": "通过（不存在欺骗误导强迫用户点击跳转） ", "failText": "不通过（存在欺骗误导强迫用户点击跳转） ", "type": "userPermissions" },
{ "id": "ed537bafdcca229218ac6eb2baa89c19", "project": "APP内广告弹窗是否可以关闭", "standard": "查看APP中的各功能处的广告弹窗是否有明显的关闭按钮。", "riskLevel": 0, "page": 10.0, "okText": "通过（有明显关闭按钮） ", "failText": "不通过（没有明显关闭按钮） ", "type": "userPermissions" },
{ "id": "f7a35d24454cbc74c2fe3d67579dd0aa", "project": "APP内广告或弹窗是否添加广告字样", "standard": "1、查看APP中的广告页面、开屏广告、主屏、弹窗等功能页面是否添加广告字样。2、除非是整改通知、权益变更、物流等弹窗不用加【广告】字样。", "riskLevel": 0, "page": 10.0, "okText": "通过（已显著标明【广告】字样） ", "failText": "不通过（未显著标明【广告】字样） ", "type": "userPermissions" },
{ "id": "cac8bd9f3c71a94a669a8050c59b41e1", "project": "APP的广告弹窗是否显著标明弹窗信息推送服务提供者身份。", "standard": "在通知栏的消息推送弹窗中应显著标明弹窗信息推送服务提供者身份。", "riskLevel": 0, "page": 10.0, "okText": "通过（已显著标明推送服务提供者身份） ", "failText": "不通过（未显著标明推送服务提供者身份） ", "type": "userPermissions" },
{ "id": "bde21fb8461891a64f985da0d636d3a4", "project": "APP是否无明显下载提示，点击即自动下载非用户所自愿下载APP", "standard": "1、通过查看APP内广告页面/开屏广告/主屏/XX 功能，无显著APP 下载提示，点击即自动下载非用户所自愿下载APP。2、通过查看APP内广告页面/开屏广告/主屏/XX 功能是否通过“偷梁换柱”“移花接木”等方式欺骗误导非用户自愿下载的 APP，包括但不限于“是否立即开始游戏”、“领取红包”、点击“下载按钮“以外区域等方式欺骗误导用户自动下载非用户所自愿下载 APP。3、是否有暂停下载非用户所自愿下载 APP，关闭并重新运行本 APP 后，自动恢复下载被暂停的非用户所自愿下载的 APP。4、通过查看APP内广告页面/开屏广告/主屏/XX 功能，通过设置关闭障碍或下载的 APP 与向用户所作的宣传或者承诺不符等方式欺骗误导强迫下载非用户所自愿下载 APP。5、下载过程必须有暂停、取消下载功能。", "riskLevel": 2, "page": 10.0, "okText": "通过（未发现存在欺骗诱导用户下载APP的行为） ", "failText": "不通过（发现存在欺骗诱导用户下载APP的行为） ", "type": "userPermissions" },
{ "id": "475e8b16a1d365815ba4f2aebbed00bf", "project": "APP是否可以便捷卸载", "standard": "除基本功能软件外，APP应当可便捷卸载，不得以空白名称、透明图标、后台隐藏等方式恶意阻挠用户卸载：a) 卸载方式不包括禁用、隐藏图标、移除图标等；b) 应确保在主屏幕预置快捷方式的应用软件能够被卸载；c) 应确保在主屏幕界面有图标的快捷方式、小程序、快应用等均能够被移除；d) 应确保在辅助屏界面有图标的小程序、快应用等均能够被移除；e) 后安装的应用软件均应支持可卸载。", "riskLevel": 2, "page": 10.0, "okText": "通过（可以便捷卸载） ", "failText": "不通过（不可以便捷卸载） ", "type": "userPermissions" },
{ "id": "502e3420a95b41ffdfac14b001b25f1b", "project": "APP服务事项是否提前告知", "standard": "清晰明示产品功能权益及资费等内容，存在开通会员、收费等附加条件的，应当显著提示。未经明示，不得在提供产品服务过程中擅自添加限制性条件，并以此为由终止用户正常使用的产品功能和服务，或降低服务体验。", "riskLevel": 2, "page": 10.0, "okText": "通过（服务事项已提前告知） ", "failText": "不通过（服务事项未提前告知） ", "type": "userPermissions" },
{ "id": "836b24b9b799e50daf80704a66d42c74", "project": "APP续期服务是否及时提醒", "standard": "采取自动续订、自动续费方式提供服务的，应当征得用户同意，不得默认勾选、强制捆绑开通。在自动续订、自动续费前5日以短信、消息推送等显著方式提醒用户，服务期间提供便捷的随时退订方式和自动续订、自动续费取消途径。", "riskLevel": 2, "page": 10.0, "okText": "通过（续期服务已提前告知） ", "failText": "不通过（续期服务未提前告知） ", "type": "userPermissions" },
{ "id": "fb6b4f1c087524c0393a36a5663be044", "project": "应用分发平台上的 APP 信息是否明示不到位", "standard": "1、通过查看APP内业务功能确认是否存在应用分发行为，如不存在应用分发行为则该项为不适用。2、若检测出APP内存在应用分发行为，查看 APP 分发应用的页面内下载前后应用名称是否一致，是否展示了真实完整有效应用名称、开发者信息、主要功能、版本信息、权限列表及用途和隐私政策等信息说明；3、查看开发者信息和版本信息是否隐藏在二级链接。", "riskLevel": 2, "page": 10.0, "okText": "通过（应用分发平台上的 APP 信息已明示） ", "failText": "不通过（应用分发平台上的 APP 信息未明示） ", "type": "userPermissions" },
{ "id": "a76167e171c0a6164b9bc54e34405984", "project": "应用分发平台管理责任落实不到位", "standard": "1、通过查看APP内业务功能确认是否存在应用分发行为，如不存在应用分发行为则该项为不适用。2、若检测出APP内存在应用分发行为，若 APP 存在应用分发行为，查看所分发 APP 的开发者身份信息是否不真实或不准确、开发者联系方式是否失效、上架审核存在不严格、违法违规软件处理不及时等情况。", "riskLevel": 2, "page": 10.0, "okText": "通过（应用分发平台管理责任落实不到位） ", "failText": "不通过（应用分发平台管理责任落实到位） ", "type": "userPermissions" }];

function makeRuleMap () {
  let result = {
    riskDetected: [],
    useRules: [],
    saveRules: [],
    externalRules: [],
    collectionRules: [],
    expressConsent: [],
    termStatus: [],
    userPermissions: [],
    sdks: [],
    appGetInformation: [],
    sdkGetInformation: [],
    appPermissions: [],
  };

  for (let index = 0; index < list.length; index++) {
    list[index].option = -1;
    list[index].suggest = "";
    const item = list[index];
    if (!item.type) {
      continue;
    }
    if (result[item.type]) {
      result[item.type].push(list[index]);
    } else {
      result[item.type] = [list[index]];
    }
  }
  return result;
}
export {
  list,
  makeRuleMap,
  RISK_DETECTED,
  USR_RULES,
  SAVE_RULES,
  EXTERNAL_RULES,
  COLLECTION_RULES,
  EXPRESS_CONSENT,
  TERM_STATUS,
  USER_PERMISSIONS,
  SDKS,
  APP_GET_INFORMATION,
  SDK_GET_INFORMATION,
  APP_PERMISSIONS,
};
